# 02 - 데이터프레임 결합

## 1.환경준비

* 라이브러리 불러오기

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

* 데이터 가져오기

In [2]:
sales = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_sales_simple.csv")

sales1 = sales.loc[sales['Store_ID']==1]
sales2 = sales.loc[sales['Store_ID']==2]
sales5 = sales.loc[sales['Store_ID']==5]
sales11 = sales.loc[sales['Store_ID']==11]

products = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_product_master.csv")
stores = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_store_master.csv")

In [3]:
sales1.head()

   Order_ID        Date  Store_ID  Qty  Product_ID
0         3  2013-01-01         1  0.0           3
1         5  2013-01-01         1  0.0           5
2         7  2013-01-01         1  0.0           7
3         8  2013-01-01         1  0.0           8
4        10  2013-01-01         1  0.0          10

In [4]:
products.head()

   Product_ID Product_Code      SubCategory         Category  LeadTime  Price
0          20        HG001  Gardening Tools  Household Goods         2     50
1          27        HH001  Home Appliances  Household Goods         2    150
2          16        HK001          Kitchen  Household Goods         2     23
3          15        HK002          Kitchen  Household Goods         2     41
4          32        GS001          Seafood          Grocery         3     34

In [5]:
stores.head()

   Store_ID           City      State  Store_Type
0         1     Saint Paul  Minnesota           4
1         2     Saint Paul  Minnesota           4
2         3     Saint Paul  Minnesota           4
3         4     Saint Paul  Minnesota           4
4         5  Oklahoma City   Oklahoma           4

## 2.결합1 : 붙이기 concat()

* 데이터를 생성해 봅시다.

In [7]:
df1 = pd.DataFrame({'A':[10,25], 'B':[15,30]})
df2 = pd.DataFrame({'A':[20,30, 50], 'C':[35,30, 40]})
df2.drop([1], inplace = True)

display(df1)
display(df2)

    A   B
0  10  15
1  25  30

    A   C
0  20  35
2  50  40

#### (1) 세로로 합치기 : axis = 0

* join = 'inner'

In [9]:
pd.concat([df1, df2], axis = 0, join = 'inner')

    A
0  10
1  25
0  20
2  50

* join = 'outer'

In [10]:
pd.concat([df1, df2], axis = 0, join = 'outer')

    A     B     C
0  10  15.0   NaN
1  25  30.0   NaN
0  20   NaN  35.0
2  50   NaN  40.0

#### (2) 가로로 합치기 : axis = 1

* join = 'inner'

In [11]:
pd.concat([df1, df2], axis = 1, join = 'inner')

    A   B   A   C
0  10  15  20  35

* join = 'outer'

In [12]:
pd.concat([df1, df2], axis = 1, join = 'outer')

      A     B     A     C
0  10.0  15.0  20.0  35.0
1  25.0  30.0   NaN   NaN
2   NaN   NaN  50.0  40.0

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

[문1] sales1,2,5,11 데이터프레임을 하나로 합칩시다. 어떻게 합치는게 좋을까요?

In [16]:
sales1.head()

   Order_ID        Date  Store_ID  Qty  Product_ID
0         3  2013-01-01         1  0.0           3
1         5  2013-01-01         1  0.0           5
2         7  2013-01-01         1  0.0           7
3         8  2013-01-01         1  0.0           8
4        10  2013-01-01         1  0.0          10

In [18]:
sales2.head()

     Order_ID        Date  Store_ID  Qty  Product_ID
165       366  2013-01-01         2  0.0           3
166       368  2013-01-01         2  0.0           5
167       370  2013-01-01         2  0.0           7
168       371  2013-01-01         2  0.0           8
169       373  2013-01-01         2  0.0          10

In [20]:
sales5.head()

     Order_ID        Date  Store_ID  Qty  Product_ID
660      1455  2013-01-01         5  0.0           3
661      1457  2013-01-01         5  0.0           5
662      1459  2013-01-01         5  0.0           7
663      1460  2013-01-01         5  0.0           8
664      1462  2013-01-01         5  0.0          10

In [22]:
sales11.head()

    Order_ID        Date  Store_ID  Qty  Product_ID
30        69  2013-01-01        11  0.0           3
31        71  2013-01-01        11  0.0           5
32        73  2013-01-01        11  0.0           7
33        74  2013-01-01        11  0.0           8
34        76  2013-01-01        11  0.0          10

In [23]:
sales0 = pd.concat([sales1, sales2, sales5 , sales11], axis = 0, join = 'inner')
sales0

       Order_ID        Date  Store_ID      Qty  Product_ID
0             3  2013-01-01         1    0.000           3
1             5  2013-01-01         1    0.000           5
2             7  2013-01-01         1    0.000           7
3             8  2013-01-01         1    0.000           8
4            10  2013-01-01         1    0.000          10
...         ...         ...       ...      ...         ...
24340     53548  2013-01-31        11   10.000          22
24341     53550  2013-01-31        11  641.507          24
24342     53553  2013-01-31        11    0.000          27
24343     53555  2013-01-31        11   27.000          29
24344     53558  2013-01-31        11   13.000          32

[1860 rows x 5 columns]

[문2] (조금 어려운 문제!)  
일별, 매장별 판매량 합계를 구해 봅시다.  
groupby, pd.concat 을 이용하여 다음과 같은 결과를 얻도록 코드를 작성해봅시다.

* 힌트
    * 1) sales1, 2, 5,11 로 부터 각각 일별 판매량 합계 집계하기
        * 집계시 .agg() 를 이용하여 열이름 변경하거나, 집계후 열이름 변경하기
    * 2) pd.concat 으로 가로로 합치기

## 3.결합 ① : 조인 join(merge)

* 판다스에서 join은 굉장히 간단합니다.
* 자동으로 key를 잡아줍니다
* default로 inner join을 합니다.

In [24]:
df1 = pd.DataFrame({'A':[1,2], 'B':[15,30], 'C':[20, 25]})
df2 = pd.DataFrame({'A':[2,3], 'D':[20, 35]})

display(df1)
display(df2)

   A   B   C
0  1  15  20
1  2  30  25

   A   D
0  2  20
1  3  35

### (1) inner merge

In [14]:
pd.merge(df1, df2, how = 'inner', on = 'A')

   A   B   C   D
0  2  30  25  20

In [25]:
pd.merge(df1, df2, how = 'inner')

   A   B   C   D
0  2  30  25  20

### (2) left merge

In [26]:
pd.merge(df1, df2, how = 'left')

   A   B   C     D
0  1  15  20   NaN
1  2  30  25  20.0

### (3) right merge

In [27]:
pd.merge(df1, df2, how = 'right')

   A     B     C   D
0  2  30.0  25.0  20
1  3   NaN   NaN  35

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

[문1] 일별, 매장별 판매량 합계를 구해 봅시다.  
groupby, pd.merge 을 이용하여 다음과 같은 결과를 얻도록 코드를 작성해봅시다.

* 힌트
    * 1) sales1, 2, 5,11 로 부터 각각 일별 판매량 합계 집계하기
        * 집계시 .agg() 를 이용하여 열이름 변경하거나, 집계후 열이름 변경하기
    * 2) pd.merge 으로 결합하기

[문2] 매장1에 대해서, 일별, 카테고리별 판매량 합계를 구해 봅시다.

[문3] 도시별, 총판매량 합계를 구하시오.

### (4) pivot
* pivot : 결합은 아니지만, 집계 후 데이터프레임 구조를 변형해서 조회하는데 종종 사용 됩니다.

* 단계
    * 1) groupby
    * 2) pivot

In [ ]:
# 1) 매장1의 일별 카테고리별 판매량을 집계

temp = pd.merge(sales1, products)
temp2 = temp.groupby(['Date', 'Category'], as_index = False)['Qty'].sum()
temp2

In [ ]:
# 2) pivot
temp3 = temp2.pivot( 'Category', 'Date' ,'Qty')
temp3

In [ ]:
# sns.heatmap으로 시각화 할 수도 있습니다!

plt.figure(figsize = (20, 6))
sns.heatmap(temp3)
plt.show()

## 4.복습문제

In [ ]:
# 라이브러리 불러오기
import pandas as pd

In [28]:
sales = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_sales_simple.csv")
products = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_product_master.csv")
stores = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_store_master.csv")

In [29]:
sales.head(3)

   Order_ID        Date  Store_ID  Qty  Product_ID
0         3  2013-01-01         1  0.0           3
1         5  2013-01-01         1  0.0           5
2         7  2013-01-01         1  0.0           7

In [30]:
products.head(3)

   Product_ID Product_Code      SubCategory         Category  LeadTime  Price
0          20        HG001  Gardening Tools  Household Goods         2     50
1          27        HH001  Home Appliances  Household Goods         2    150
2          16        HK001          Kitchen  Household Goods         2     23

In [31]:
stores.head(3)

   Store_ID        City      State  Store_Type
0         1  Saint Paul  Minnesota           4
1         2  Saint Paul  Minnesota           4
2         3  Saint Paul  Minnesota           4

1) sales에 금액(Amt) 변수를 추가하시오.
* Amt = Qty * Price

In [35]:
# sales2 = pd.merge( sales, products.loc[:,['Product_ID','Price']], how ='inner', on='Product_Id' )


sales2 = pd.merge(sales, products, how="inner" , on="Product_ID" )
sales2.head()

,Order_ID,Date,Store_ID,Qty,Product_ID,Product_Code,SubCategory,Category,LeadTime,Price
0,3,2013-01-01,1,0.0,3,DB001,Beverage,Drink,2,8
1,36,2013-01-01,10,0.0,3,DB001,Beverage,Drink,2,8
2,69,2013-01-01,11,0.0,3,DB001,Beverage,Drink,2,8
3,102,2013-01-01,12,0.0,3,DB001,Beverage,Drink,2,8
4,135,2013-01-01,13,0.0,3,DB001,Beverage,Drink,2,8

In [40]:
sales2['Amt'] = sales['Qty'] * products['Price']
sales2.head()

,Order_ID,Date,Store_ID,Qty,Product_ID,Product_Code,SubCategory,Category,LeadTime,Price,Amt
0,3,2013-01-01,1,0.0,3,DB001,Beverage,Drink,2,8,0.0
1,36,2013-01-01,10,0.0,3,DB001,Beverage,Drink,2,8,0.0
2,69,2013-01-01,11,0.0,3,DB001,Beverage,Drink,2,8,0.0
3,102,2013-01-01,12,0.0,3,DB001,Beverage,Drink,2,8,0.0
4,135,2013-01-01,13,0.0,3,DB001,Beverage,Drink,2,8,0.0

2) 상품 별 매출액

In [41]:
sales2.groupby('Product_Code', as_index = False)['Amt'].sum()

   Product_Code  Amt
0         DA001  0.0
1         DB001  0.0
2         FB001  0.0
3         FF001  0.0
4         FM001  0.0
5         FP001  0.0
6         GA001  0.0
7         GE001  0.0
8         GM001  0.0
9         GS001  0.0
10        HC001  0.0
11        HG001  0.0
12        HH001  0.0
13        HK001  0.0
14        HK002  0.0

3) City별 카테고리리별 매출액

4) 매출액이 가장 높은 주(state) top 3